## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| update | `aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]` |
|        | `aws_cloudwatch_metric_alarm.route53_ddos[0]`               |
| add    | `aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1]` |
|        | `aws_cloudwatch_metric_alarm.route53_ddos[1]`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0] will be updated in-place
  # (moved from aws_cloudwatch_metric_alarm.ddos_detected_route53_warn)
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
      ~ dimensions                = {
          ~ "ResourceArn" = "arn:aws:route53:::hostedzone/Z1031499PBK3926Y7HKK" -> "mocked_zone_id_forms-formulaires.alpha.canada.ca"
        }
        id                        = "DDoSDetectedRoute53Warn"
        tags                      = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "End User Forms Warning - AWS has detected a DDOS attack on the End User Forms's DNS Server"
      + alarm_name                            = "DDoSDetectedRoute53Warn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "mocked_zone_id_forms-formulaires.canada.ca"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.route53_ddos[0] will be updated in-place
  # (moved from aws_cloudwatch_metric_alarm.route53_ddos)
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      ~ dimensions                = {
          ~ "ResourceArn" = "arn:aws:route53:::hostedzone/Z1031499PBK3926Y7HKK" -> "mocked_zone_id_forms-formulaires.alpha.canada.ca"
        }
        id                        = "Route53DDoS"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.route53_ddos[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "DDoS detection for Route53"
      + alarm_name                            = "Route53DDoS"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "mocked_zone_id_forms-formulaires.canada.ca"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:957818836222:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[1]"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
